// ************************************************
//
//	main.js
//	ラーメンタイマーの、タイマー部分のスクリプト
//
//	version: 0.1
//	Copyright: 2015 fififactory
// ************************************************

console.log("== Run main.js ==");


// Global Variable
// ===============
// ユーザ指定定数
MAX_CNT = 180; // 180[sec]
ONE_SEC = 1000; // 1000[ms] = 1[s]
// タイマーの残り時間(秒) 3分->180
gTimCnt = 0;
// タイマーオブジェクト
gTimObj = 0;
// タイマーフラグ
gTimFlg = 0; //0:停止, 1:アクティブ


// functions
// =========
// 一番最初の初期化をしておく
reset();


// =================================================
// myGo()
// =================================================
// ボタンが押されたら呼び出される中間関数
// タイマーの開始(スタート)か、停止(ストップ)を判定して、
// それぞれの関数を呼び出す。
// =================================================
function myGo(){
	if( gTimFlg ){
		// 1:アクティブ中 -> タイマー停止
		reset();
	}else{
		// 0:停止中 -> タイマー生成・開始
		start();
	}
}


// =================================================
// myTimer()
// =================================================
// 時間を進行させて、画面を更新する関数(毎秒呼ばれる)。
// ONE_SEC(1秒)ごとに呼び出される。
// 残り時間変数gTimCntをデクリメント。
// 残り時間の描画
// もし、残り時間が0になれば、タイマーを停止するreset関数を呼び出す
// =================================================
function myTimer(){
	// 残り時間をデクリメント
	gTimCnt = gTimCnt - 1;
	// 残り時間(分, 秒)を計算して、ゼロ埋め
	var view_min = ( "0" + Math.floor(gTimCnt / 60) ).slice(-2);
	var view_sec = ( "0" + Math.floor(gTimCnt % 60) ).slice(-2);
	// 画面更新
	document.getElementById( "time" ).innerHTML = view_min + ":" + view_sec;
	// 終了判定
	if ( gTimCnt == 0 ){
		reset();
		alert( "ラーメン食べ頃だよ！！" );
	}
}


// =================================================
// reset()
// =================================================
// リセット関数
// 状態フラグgTimFlgのトグル。タイマーの停止。表示の更新
// =================================================
function reset(){
	// 停止フラグに変更
	gTimFlg = 0;
	// タイマーオブジェクトの停止
	clearInterval( gTimObj );
	// 残り時間(分, 秒)を計算して、ゼロ埋め
	var view_min = ( "0" + Math.floor(MAX_CNT / 60) ).slice(-2);
	var view_sec = ( "0" + Math.floor(MAX_CNT % 60) ).slice(-2);
	document.getElementById( "time" ).innerHTML = view_min + ":" + view_sec;

}


// =================================================
// start()
// =================================================
// タイマー開始
// 状態フラグgTimFlgのトグル。タイマー生成。
// =================================================
function start(){
	// 0:停止中 -> タイマー生成・開始
	gTimFlg = 1;
	// 残り時間をリセット
	gTimCnt = MAX_CNT;
	// タイマーを開始。(1秒ごとにmyTimer()関数を呼び出す)
	gTimObj = setInterval ( "myTimer()", ONE_SEC );
}